# ЗАДАЧА 8: Криптопортфейл
# История:
# Потребители имат криптовалути. Трябва да изчислиш стойността на всеки портфейл.
# users = { "Иван": {"BTC":(0.1,60000),"ETH":(2,2000)}, "Мария": {"BTC":(0.05,60000),"DOGE":(1000,0.08)} } print(portfolio_value(users))
#
# Очакван изход: ({'Иван':10000,'Мария':7000}, 'Иван')


users = { "Иван": {"BTC":(0.1,60000),"ETH":(2,2000)}, "Мария": {"BTC":(0.05,60000),"DOGE":(1000,0.08)} }

print(portfolio_value(users))

# Очакван изход: ({'Иван':10000,'Мария':7000}, 'Иван')